# 10. intent
### 1. 인텐트 란?
1. 인텐트란 메시징 객체이다.
2. 다른 앱에게 작업을 요청할 때 사용
3. 인텐트가 구성요소 사이의 통신을 촉진하는 방식
  1. 액티비티 시작
      - 액티비티 : 앱 안의 단일 화면을 나타냄
      - 액티비티의 새 객체를 사용하려면 intent를 startActivity()로 전달하면 된다.
      - intent는 시작할 액티비티를 설명하고 모든 필수 데이터를 담는다.
      - startActivityForResult() : 액티비티가 완료되었을 때 결과를 수신하기 위해 액티비티는 해당 결과를 이 액티비티의 onActivityResult() 콜백에서 별도의 Intent 객체로 수신한다.
  2. 서비스 시작
      - android 5.0 이상(API 21) 부터 JobScheduler로 서비스 시작
      - android 5.0 이하 버전은 service 클래스의 메서드를 사용하면 서비스를 시작할 수 있다.
  3. 브로드 캐스트 전달
      - 브로드 캐스트 : 모든 앱이 수신할 수 있는 메세지
      - 시스템은 시스템이 부팅될 때 또는 기기가 충전을 시작할 때 시스템 이벤트에 대한 다양한 브로드 캐스트를 전달한다.
### 2. 인텐트 유형
1. 명시적 인텐트 
    - 인텐트를 충족하는 앱이 무엇인지 지정한다.
    - 이를 위해 대상 앱의 패키지 이름 또는 완전히 자격을 갖춘 구성 요소 클래스 이름을 제공한다.
    - 명시적 인텐트는 일반적으로 앱 안에서 구성 요소를 시작할 때 쓴다. 
    - 시작하고자 하는 액티비티 또는 서비스의 클래스 이름을 알고 있기 때문입니다. 
2. 암시적 인텐트
    - 특정 구성 요소의 이름을 대지 않지만, 그 대신 수행할 일반적인 작업을 선언하여 다른 앱의 구성 요소가 이를 처리할 수 있도록 해줍니다.
    - 암시적 인텐트를 사용하면 android 시스템에서 시작할 적절한 구성요소를 찾습니다. 
    - 이 때 인텐트의 내용을 기기에 있는 다른 여러 앱의 매니페스트 파일에서 선언된 인텐트 필터와 비교하는 방법을 사용합니다.
    - 해당 인텐트와 일치하는 인텐트 필터가 있으면 시스템에서 해당 구성 요소를 시작하고 이를 intent 객체를 전달합니다.
    - 호환되는 인텐트 필터가 여러개인 경우, 시스템 상자에서 사용자가 어느 앱을 사용할지 직접 선택할 수 있게 합니다.
    - 인텐트 필터란 앱의 메니페스트 파일에 들어있는 표현으로, 해당 구성요소가 수신하고자 하는 인텐트의 유형을 나타냅니다.
    - 예를 들어 액티비티에 대한 인텐트 필터를 선언하면 다른 여러 앱이 특정한 종류의 인텐트를 가지고 액티비티를 직접 시작할 수 있습니다.
    - 마찬가지로 액티비티에 대한 인텐트 필터를 선언하지 않는 경우 이것은 명시적 인텐트로만 시작할 수 있습니다.
### 3. 인텐트 빌드
1. 인텐트 객체에는 android 시스템이 어느 구성 요소를 시작할지 판별하는 데 사용하는 정보가 담겨 있다. 
2. 예를 들어 정확한 구성 요소 이름 또는 인텐트를 수신해야하는 구성요소 카테고리 등
3. 또한 수신자 구성 요소가 작업을 적절히 수행하기 위해 사용할 정보도 이 안에 담겨 있다.
4. 인텐트에 포함된 기본 사항
    - 구성 요소 이름
      - 시작할 구성 요소 이름
      - 선택항목이지만 인텐트를 명시적으로 만들어주는 중요한 정보이다.
      - 다시 말해 이 인텐트는 구성 요소 이름이 정의한 앱 구성 요소에만 전달되어야한다는 뜻이다.
      - 구성 요소 이름이 없으면 해당 인텐트는 암시적이며, 인텐트를 수신해야하는 구성요소는 다른 인텐트 정보를 기반으로 시스템이 결정한다.
   - 작업
      - 수행할 작업을 나타내는 문자열입니다.
      - 브로드 캐스트 인텐트의 경우 이미 실행되어 보고되고 있는 작업입니다. 
      - 인텐트가 사용할 작업을 직접 지정할 수 있지만 보통은 상수를 지정한다.
      - ACTION_VIEW : 이 작업은 액티비티가 사용자에게 표시할 수 있는 정보를 가지고 있을 때 startActivity()가 있는 인텐트에서 사용한다.
      - ACTION_SEND : 공유 인텐트라고도 하며, 사용자가 다른 앱을 통해 공유할 수 있는 데이터를 가지고 있을 때 startActivity()가 있는 인텐트에서 사용해야한다.
   - 데이터
      - 작업을 수행할 데이터 및 해당 데이터의 MIME유형을 참조하는 URI(uri 객체)입니다.
      - 제공된 데이터의 유형을 나타내는 것은 일반적으로 인텐트의 작업니다. 
      - 예를 들어 인텐트가 ACTION_EDIT인 경우, 데이터에 편집할 문서에 URI가 들어있어야 합니다.
      - 인텐트를 생성할 때는 URI 외에 데이터 유형(데이터의 MIME 유형)을 지정하는 것이 중요한 경우가 많습니다.
   - 카테고리
      - 인텐트를 처리해야하는 구성 요소의 종류에 관한 추가 정보를 담은 문자열입니다.
      - 대부분의 인텐트에는 카테고리가 없어도 된다.
      - CATEGORY_BROWSABLE : 대상 액티비티가 웹브라우저를 통해 시작되도록 허용하고 이미지, 메시지등의 링크로 참조돈 데이터를 보이게 한다.
      - CATEGORY_LAUNCHER : 이 액티비티가 작업의 최초 액티비티이며, 시스템의 앱 시작 관리자에 목록으로 게재됩니다.
      - 카테고리는 addCategory()로 지정할 수 있습니다.
    - 엑스트라
      - 요청된 작업을 수행하는 데 필요한 추가 정보가 담긴 키-값 쌍입니다. 
      - 몇몇 작업이 특정한 종류의 데이터 URI를 사용하는 것과 마찬가지로, 몇몇 작업은 특정한 엑스트라도 사용합니다.
      - 다양한 putExtra() 메서드로 엑스트라 데이터를 추가할 수 있습니다.
      - 각 메서드는 키 이름과 값, 이렇게 두 개의 매개변수를 취합니다.
      - 또한 모든 엑스트라 데이터를 포함한 Bundle 객체를 만든 다음 Bundle을 Intent에 putExtra()로 삽입할 수 있습니다.
      - 예를 들어 ACTION_SEND로 이메일을 전송할 인텐트를 생성하는 경우 받는 사람 수신자를 지정할 때 EXTRA_EMAIL키를 사용한다음 제목은 EXTRA_SUBJECT키로 지정하면 됩니다.
      - Intent 클래스는 표준화된 데이터 유형에 대해 여러가지 EXTRA 상수를 지정합니다.
      - 나름의 엑스트라 키를 선언해야 하는 경우 (본인의 앱이 수신할 인텐트에 대하여), 앱의 패키지 이름을 접두어로 포함해야 합니다.
    - 플래그
      - 플래그는 Intent 클래스에서 정의되고, 인텐트에 대한 메타데이터(상위 구성요소에 제공될 수 있는 추가 임의 데이터 항목의 이름-값 쌍)와 같은 기능을 합니다.
      - 이런 플래그는 안드로이드 시스템에 액티비티를 시작할 방법에 대한 지침을 줄 수도 있고 (예를 들어 액티비티가 어느 작업에 소속되어야 하는 지 등)액티비티를 시작한 다음에 어떻게 처리해야하는 지도
      알려줄 수 있습니다. (예를 들어 해당 액티비티가 최근 액티비티 목록에 소속되는지 여부)
 
 ### 4. 암시적 인텐트 수신
 1. 앱이 수신할 수 있는 암시적 인텐트가 어느 것인지 알리려면, <intent-filter> 요소를 사용해서 각 앱 구성 요소에 대해 하나 이상의 인텐트 필터를 매니페스트 파일에 선언합니다.
 2. 각 인텐트 필터는 인텐트의 작업, 데이터 및 카테고리를 기반으로 어느 유형의 인텐트를 수락하는지 지정합니다.
 3. 시스템은 인텐트가 인텐트 필터 중 하나를 통과한 경우에만 암시적 인텐트를 앱 구성 요소에 전달합니다.
 4. 엡 구성요소는 자신이 수행할 수 있는 각각의 고유한 작업에 대하여 별도의 필터를 선언해야 합니다.
 5. 각 인텐트 필터는 앱의 메니페스트 파일에 있는 <intent-filter>요소에서 정의하고, 이는 대응되는 앱 구성요소에서 중첩 됩니다.
 6. <intent-filter> 내부에서는 다음과 같이 세가지 요소 중 하나 이상을 사용하여 허용할 인텐트 유형을 지정할 수 있습니다.
 7. <action> : name 특성에서 허용된 인텐트 작업을 선언합니다. 이 값은 어떤 작업의 리터럴 문자열 값이어야하며, 클래스 상수가 아닙니다.
 8. <data> : 허용된 데이터 유형을 선언합니다. 이 때 데이터 URI(scheme,host,oirt,path)와 MIME 유형의 여러 가지 측면을 나타내는 하나 이상의 특성을 사용합니다.
 9. <category> : name 특성에서 허용된 인텐트 카테고리를 선언합니다. 이 값은 어떤 작업의 리터럴 문자열 값이어야 하며, 클래스 상수가 아닙니다.
 
 ### 5. pending intent
 1. pending intent 객체는 intent 객체 주변을 감싸는 래퍼 입니다.
 2. pending intent 의 기본 목적은 외부 앱에 권한을 허가하여 안에 들어있는 intent를 마치 본인 앱의 자체 프로세스에서 실행하는 것 처럼 사용하게 하는 것입니다.
 3. 사용 사례
    - notificationManager
    - 사용자가 여러분의 앱 위젯으로 어떤 작업을 수행할 때 인텐트가 실행되오록 선언합니다.(메인 화면 앱이 Intent를 실행합니다.)
    - 향후 지정된 시간에 인텐트가 실행되도록 선언합니다. (alarmManager)
 4. 각 Intent 객체는 특정한 유형의 앱 구성요소(Activity,Service, BroadcastReceiver)가 처리하도록 설계되어 있으므로, Pending Intent도 같은 고려사랑을 생각해서 생성해야합니다.
 5. 보류 인텐트를 사용하는 경우, 여러분의 앱은 startActivity()와 같은 호출이 있는 앱을 실행하지 않게 됩니다.


 
